# 1. 삼각형 면적 계산하기
# a = int(input('밑변을 입력해주세요 : '))
# b = int(input('높이를 입력해주세요 : '))
# print(a*b*0.5)

# 2. 삼각형의 각도를 출력하기
# a = int(input('각을 입력해주세요 : '))
# b = int(input('각를 입력해주세요 : '))
# print(180-a-b)

# 3. 평균성적 출력하기
# a = []
# for i in range(4):
#     a.append(int(input('성적을 입력해주세요')))
# print(sum(a)/len(a))

# 4. 원의 지름 계산하기
# a = int(input('r을 입력해주세요 : '))
# print(a*2*3.14)

# 5. 음식 값 계산하기
# a = int(input('가격을 입력해주세요 : '))
# print(a+a*0.1+a*0.07)

# 6. 주행거리 계산
# a = int(input('가속도를 입력해주세요 : '))
# t = int(input('주행시간을 입력해주세요 : '))
# print(0.5*a*t*t)

# 7. 섭씨로 변환하기
# f = int(input('화씨를 입력해주세요 : '))
# print(5*((f-32)//9))

# 8. 체질량지수
# a = int(input('키를 입력해주세요 : '))
# b = int(input('몸무게를 입력해주세요 : '))
# print(b//(a*a))

# 9. 팁 계산
# 소계 = int(input('소계를 입력해주세요 : '))
# 팁 = int(input('팁을 입력해주세요 : '))
# 팁계산 = 소계*팁//100
# print(f'팁은 {팁계산}원이고, 총계는 {소계+팁계산}원 입니다.')

# 10. 세후, 평균가격 계산
# 상품들=[]
# for i in range(3):
#     가격 = int(input('가격을 입력해주세요 : ')) 
#     상품들.append(가격*0.2+가격)
# print(f'상품1 : {상품들[0]}, 상품2 : {상품들[1]}, 상품3 : {상품들[2]}')
# print(f'상품 평균 가격은 : {sum(상품들)/len(상품들)}원입니다.')

# 11. 세전계산
# 가격 = int(input('가격 입력해주세요 : '))
# print(가격*0.2+가격)

# 12. 초기가격 할인율
# 가격 = int(input('가격 입력해주세요 : '))
# 할인율 = int(input('할인율을 입력해주세요 : '))
# print(f'{가격}, {가격*(100-할인율)}')

# 13. 전력소비량
# a = int(input('전력을 입력해주세요 : '))
# print(a*600+가격*0.2)

# 14. 날짜 계산
# 월 = int(input('월을 입력해주세요 : '))
# 일 = int(input('일을 입력해주세요 : '))
# print((월-1)*30+(일-1))

